"""ВВОД ДАННЫХ"""
# Функция input() в Python используется для получения данных от пользователя во время выполнения программы.
# Когда вызывается input(), выполнение программы приостанавливается, и она ожидает, пока пользователь введёт данные
# с клавиатуры и нажмёт Enter.
# Введённое значение возвращается функцией в виде строки (тип str), даже если пользователь вводит число!

# name = input('Введите Ваше имя: ')
# print('Добрый день,', name + '!')


# name = input('Как тебя зовут? \n')
# print(f'БУ! Не бойся {name.capitalize()}! \nИди сюда!\nИди ко мне!')  # capitalize
# # - возвращает копию строки str с первым символом в верхнем регистре


# _tuple = tuple(map(int, input('Введи сколько угодно цифр через пробел: ').split()))
# print(f'Получился кортеж: {_tuple}')

# _list = list(map(str, input('Введите ваше ФИО через пробел: ').split()))
# print(f'Получился список: {_list}')
