"""ЦИКЛ while"""
# Цикл while в Python является одним из основных инструментов для выполнения повторяющихся операций.
# Он позволяет выполнять блок кода до тех пор, пока условие остается истинным.
# Это делает его особенно полезным для задач, где количество итераций заранее неизвестно.

# x = 8
# while x > 0:
#     print(x)
#     x -= 1


# number = 1
# while number <= 5:
#     print(f"number = {number}")
#     number += 1
# print("Работа программы завершена")


# number = 1  # инициализация переменной
# while number < 5:  # пока значение number меньше 5, выполняется тело цикла:
#     print(f"number = {number}")
#     number += 1
# else:
#     print(f"number = {number} - Конец цикла!")  # когда number стало равно 5, цикл завершился и выполняется эта строка
# print("Работа программы окончена.")


# Таблица умножения:
# e = r = 1
# while e < 10:
#     while r < 10:
#         print(e, '*', r, '=', e * r, end='  |  ')
#         r += 1
#     print()
#     r = 1
#     e += 1


# i = 1
# j = 1
# while i < 10:
#     while j < 10:
#         print(i * j, end="\t")
#         j += 1
#     print("\n")
#     j = 1
#     i += 1
