"""ОПЕРАТОРЫ СРАВНЕНИЯ"""
# 1. Равно (==)
# Оператор == проверяет, равны ли два значения. Если они равны, он возвращает True; в противном случае — False.

age = 18
if age == 18:
    print("Вам 18 лет!")  # Вывод: Вам 18 лет!


# 2. Не Равно (!=)
# Оператор != проверяет, не равны ли два значения. Если они разные, он возвращает True; в противном случае — False.

password = "Python123"
if password != "admin":
    print("Доступ запрещен!")  # Вывод: Доступ запрещен!


# 3. Больше (>)
# Оператор > проверяет, больше ли значение слева, чем значение справа.

score = 85
if score > 75:
    print("Вы прошли тест!")  # Вы прошли тест!


# 4. Меньше (<)
# Оператор < проверяет, меньше ли значение слева, чем значение справа.

temperature = 18
if temperature < 20:
    print("Прохладно!")  # Вывод: Прохладно!


# 5. Больше или Равно (>=)
# Оператор >= проверяет, больше ли значение слева или равно значению справа.

grade = 70
if grade >= 60:
    print("Вы прошли курс!")  # Вывод: Вы прошли курс!


# 6. Меньше или Равно (<=)
# Оператор <= проверяет, меньше ли значение слева или равно значению справа.

hours = 5
if hours <= 8:
    print("Вы отработали обычную смену.")  # Вывод: Вы отработали обычную смену.
