"""ОПЕРАТОРЫ ПРИСВАИВАНИЯ"""
# Чаще всего для присваивания мы используем оператор =, но есть и другие варианты.

# 1. Обычное присваивание
# x = 5
# print(x)  # 5


# 2. Множественное присвоение в одну строку
# x = y = z = 0 # Все три переменные получают значение 0


# 3. Последовательное присвоение разных значений
# a, b, c = 1, 2, 3  # a=1, b=2, c=3


# Арифметические операции:
# += (плюс равно)
# Добавляет значение расположенное справа от него, к переменной слева, а затем присваивает результат этой же переменной:
# x = 5
# x += 3 # эквивалентно x = x + 3
# print(x)  # 8


# -= (минус равно)
# # Вычитает значение, расположенное справа, из переменной слева, а затем присваивает результат переменной:
# x = 5
# x -= 3 # Эквивалентно x = x - 3
# print(x)  # 2


# *= (умножить равно)
# Оператор умножает значение слева на значение справа, а потом присваивает результат переменной:
# x = 5
# x *= 3 # Это эквивалентно x = x * 3
# print(x)  # 5


# /= (делить равно)
# Оператор делит значение слева на значение справа, а затем присваивает результат переменной:
# x = 10
# x /= 2 # Это эквивалентно x = x / 2
# print(x)  # 5.0

# Аналогично работают операторы //=, **=, %= для целочисленного деления, возведения в степень и остатка от деления.
