"""ОПЕРАТОРЫ ПРИСВАИВАНИЯ"""
# Чаще всего для присваивания мы используем стандартный оператор =, но есть и другие варианты, которые упрощают
# и даже ускоряют код.

# = (обычное присваивание)
# Присваивает значение справа переменной слева:
# x = 5
# print(x)  # Output: 5


# += (плюс равно)
# Добавляет значение расположенное справа от него, к переменной слева, а затем присваивает результат этой же переменной:
# x = 5
# x += 3  # Эквивалентно x = x + 3
# print(x)  # Output: 8


# -= (минус равно)
# # Вычитает значение, расположенное справа, из переменной слева, а затем присваивает результат переменной:
# x = 5
# x -= 3  # Эквивалентно x = x - 3
# print(x)  # Output: 2


# *= (умножить равно)
# Оператор умножает значение слева на значение справа, а потом присваивает результат переменной:
# x = 5
# x *= 3  # Это эквивалентно x = x * 3
# print(x)  # Output: 5


# /= (делить равно)
# Оператор делит значение слева на значение справа, а затем присваивает результат переменной:
# x = 10
# x /= 2  # Это эквивалентно x = x / 2
# print(x)  # Output: 5.0

# Аналогично работают операторы //=, **=, %= для целочисленного деления, возведения в степень и остатка от деления.
