# ГОРЯЧИЕ КЛАВИШИ:
# Найти любое действие в IDE Ctrl + Shift + A
# РЕДАКТИРОВАНИЕ
# Показать действия намерения Alt + Enter
# Автозавершение кода Ctrl + Пробел
# Smart автозавершение кода Ctrl + Shift + Пробел
# Завершение имени типа Ctrl + Alt + Пробел
# Полная инструкция Ctrl + Shift + Enter
# Информация о параметрах/контекстная Ctrl + P / Alt + Q
# Быстрое определение Ctrl + Shift + I
# Быстрая/внешняя док-ция Ctrl + Q / Shift + F1
# Сгенерировать код Alt + Insert
# Переопределить/внедрить элем-ты Ctrl + O / Ctrl + I
# Окружить Ctrl + Alt + T
# Строковый комментарий Ctrl + /
# Расширить/сжать выделение Ctrl + W / Ctrl + Shift + W
# Оптимизировать импорт Ctrl + Alt + O
# Автоматический отступ строк Ctrl + Alt + I
# Копировать путь Ctrl + Shift + C
# Вставить из истории буфера Ctrl + Shift + V
# Дублировать текущую строку/выделение Ctrl + D
# Удалить строку при вставке Ctrl + Y
# Переключить регистр Ctrl + Shift + U
# Развернуть/свернуть код Ctrl + NumPad + / -
# Развернуть/свернуть все Ctrl + Shift + NumPad + / -
# Сохранить все Ctrl + S
